chat_system_1827071920_actor_description=Torn Digor. Dwarves' king.
chat_system_1827071920_snap_0_question=^?^Good day, [player]. What brings you to ancient Taron?
chat_system_1827071920_snap_0_answer_0=^?^Creiston Mines. I'd like to know more about them.
chat_system_1827071920_snap_0_answer_1=^?^I have a map which I'm sure you would be interested in... King Fandor's map!
chat_system_1827071920_snap_0_answer_2=^?^Good day, Your Majesty. I've brought you a petition from the miners.
chat_system_1827071920_snap_0_answer_3=^?^Tell me about the Portal that leads to Demonis...
chat_system_1827071920_snap_0_answer_4=^?^I would like to know more about the war with the demons...
chat_system_1827071920_snap_0_answer_5=^?^I have to go. See you!
chat_system_1827071920_snap_2_question=^?^Creiston Mines is a good and rich place... There's enough ore for hundreds of years of development. Crystalline, iron, semurite, kelgorite, mithril...<br>The mines have always belonged to Darion, but humans don't need anything except emeralds - a gemstone which we use but rarely. Thus my great grandfather arranged with your king that for rent and a half of all extracted emeralds, dwarves would be allowed to use Creiston Mines. Thereafter we pay to mine, and mine to pay.<br>Everything was ok until your damned baron interfered...
chat_system_1827071920_snap_2_answer_0=^?^I have some more questions, Your Majesty.
chat_system_1827071920_snap_2_header_0=^?^Yes, what else do you want to know, human?
chat_system_1827071920_snap_2_answer_1=^?^Thank you for your explanations, Your Majesty.
chat_system_1827071920_snap_5_question=^?^Fandor's map? Our sages told me about it. Anyone who sits upon a throne can use its magical properties! Give it to me!
chat_system_1827071920_snap_5_answer_0=^?^I'll give it to you with pleasure. But what can you offer to me for it?
chat_system_1827071920_snap_6_question=^?^For that map I am ready to give the most precious thing I have. A mithril shield!
chat_system_1827071920_snap_6_answer_0=^?^A mithril shield? I think that's a worthy price for Fandor's map. I agree.
chat_system_1827071920_snap_6_answer_1=^?^I'll think about it.
chat_system_1827071920_snap_1_question=^?^As for the portal... That was created in those ancient times when dwarves primarily used magic, and technology and science were the pursuits of lonely dwarven experimenters... I hope my words are not too strange?<br>...So, our masters of magic created the first - and the last - Magic Portal. It was truly a great event! The best mages came for the opening, we had organized a festival... But that happy day turned into a day of mourning, and nearly heralded the extinction of our people...<br>It turned out that this portal led to Demonis, the Land of the Demons... You must know what happened in Darion during the reign of King Kerus, right? The same happened here: demons poured out of the portal, and the dwarven race was nearly destroyed...
chat_system_1827071920_snap_1_answer_0=^?^So, as far as I understand, you were able to lock the Portal?
chat_system_1827071920_snap_3_question=^?^Of course, we tried to destroy it first, but... if a dwarf makes something, it's built for ever.<br>Were it not for our engineers, who were able to lock the Portal with their intricate devices, Kordar would have become no more than burnt, lifeless caves. Demons easily disposed of our magic, but we found that they could not resist our mechanical devices, and so we managed to lock the Portal. Long after that, we were still hunting demons in the caves, until the last one was killed.<br>The capital was then moved into Taron, and the place where the Portal was situated was declared forbidden. And magic was forbidden as well. Many of our mages were killed by demons, and technics proved that it is stronger than spells...
chat_system_1827071920_snap_3_answer_0=^?^So, how is it to live without magic?
chat_system_1827071920_snap_3_header_0=^?^Take a look around! Technics is the engine of progress... Steam hammers, dirigibles, elevators, self-shooting arbalests, cannons... And what about steam locomotives and lightning cans - have you seen them? And book-typing factories and weaving-mills?<br>That is true power! When magic was prohibited, our king gathered all the technicians, alchemists and engineers in the castle and declared Kordar to be the world's greatest stronghold for scientific and mechanical progress! He gave the whole island of Mehgard to scientists and technicians, that they could carry out their research there, and beat the drum of dwarven progress. And they were given everything they needed - money, equipment, and rare elements necessary for their experiments... Our youth became especially enthusiastic about science, and young dwarves came to Mehgard from all the corners of the country for studying.
chat_system_1827071920_snap_4_question=^?^Demons came to Kordar from the Magic Portal, which was created once by our mages... In the distant past we had mages, ah yes. That time we managed to stop the demons and lock the portal, but we paid a heavy price for it! For some centuries we looked at the locked portal with fear, but eventually we forgot about it for several thousands of years. <br>We thought that we were perfectly free from the invaders from Demonis, but... Recently orcs came to us, and we haven't found a common language with them. They stole the key and got to the Portal, and opened it again.
chat_system_1827071920_snap_4_answer_0=^?^Well, it's obvious. Demons again, war again... Why don't you just close the Portal again?
chat_system_1827071920_snap_4_header_0=^?^When those damned orcs opened the portal, the demons killed half of them immediately, and took the Portal Key. That key can only be made once, together with the portal.<br>Our engineers propose to make an identical matrix of our old portal, in order to make the new key - and that's not easy; it could take years, especially now that our drafts of the old portal have been stolen by orcs.
